const locations = [
    {
        name: "โรงพยาบาล",
        roles: ["หมอ", "พยาบาล", "คนไข้", "เภสัชกร", "ยาม", "พนักงานทำความสะอาด", "ผู้อำนวยการ"]
    },
    {
        name: "ธนาคาร",
        roles: ["พนักงานต้อนรับ", "ผู้จัดการ", "โจร", "ยาม", "ลูกค้า", "พนักงานขับรถขนเงิน", "พนักงานทำความสะอาด"]
    },
    {
        name: "โรงเรียน",
        roles: ["ครูใหญ่", "ครู", "นักเรียน", "ภารโรง", "แม่ครัว", "ผู้ปกครอง", "ยาม"]
    },
    {
        name: "ร้านอาหาร",
        roles: ["เชฟ", "เด็กเสิร์ฟ", "ลูกค้า", "ผู้จัดการร้าน", "นักดนตรี", "คนล้างจาน", "นักวิจารณ์อาหาร"]
    },
    {
        name: "เครื่องบิน",
        roles: ["กัปตัน", "แอร์โฮสเตส", "ผู้โดยสารชั้นหนึ่ง", "ผู้โดยสารชั้นประหยัด", "ช่างเครื่อง", "สจ๊วต", "ตำรวจอากาศ"]
    },
    {
        name: "สถานีตำรวจ",
        roles: ["สารวัตร", "ตำรวจจราจร", "ผู้ร้าย", "ทนายความ", "นักข่าว", "พยาน", "เจ้าหน้าที่พิสูจน์หลักฐาน"]
    },
    {
        name: "งานวัด",
        roles: ["คนขายลูกชิ้น", "เด็กวัด", "คนปาโป่ง", "คนเชิดสิงโต", "คนดู", "พระ", "มัคทายก"]
    },
    {
        name: "ตลาดสด",
        roles: ["คนขายผัก", "คนขายหมู", "คนเข็นผัก", "ลูกค้า", "เทศกิจ", "คนขายลอตเตอรี่", "ขอทาน"]
    },
];

module.exports = { locations };
